Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Update Licence: if you have bought a new licence to upgrade GameMaker: Studio to a new version or to add a new target module, then you should select this option to activate it.
zh_cn: 升级许可: 如果购买了新的许可用于升级 GameMaker: Studio 的版本或添加新的模块，点击该选项 激活 它。

source: Website: Connects you to the YoYo Games official website.
zh_cn: 网站: 访问 YoYo Games 官方网站。

source: Welcome: This is the start-up screen you see when opening up GameMaker: Studio.
zh_cn: 欢迎: 打开 GameMaker: Studio 时启动屏幕的标准界面，

source: Window: This menu contains options for the various sub-windows that you can create for debugging.
zh_cn: Window:在这个菜单中包含你能在调试的时候生成的多种子窗口的选项。

source: a++ will increment the variable but return the value before it was incremented.
zh_cn: a++ 递增变量但是返回增加前的值。

source: div, mod (%) - Division and modulo, where div gives you the amount a value can be divided into producing only an integer quotient, while mod gives you only the remainder of a division.
zh_cn: div, mod (%) - 整除和取模（求余），“x div y” 的运算是给定两个值相除获取一个整数的商，而 mod 操作符返回其两个操作数相除的余数（GM文档：也就是说，x mod y = x - (x div y) * y ）。

source: |, &, ^, <<, >>: You can perform bitwise operations with these, where | = bitwise or, & = bitwise and, ^ = bitwise xor, << = shift left, >> = shift right.
zh_cn: |, &, ^, <<, >>：你可以使用这些进行位运算， | = 位运算“或”，& = 位运算“与”， ^ = 位运算“异或”， << = 左移， >> = 右移。

source: ~: negates the next value bitwise
zh_cn: ~: 按位取反（1变0，0变1），详见度娘查询“按位取反”。

source: Note: It does not end the execution of the game.
zh_cn: 注意： 它不会结束游戏的运行。

source: You must do this otherwise it will not work correctly.
zh_cn: 你必须这么做否则它不会正常工作。

source: Steam users have three additional buttons on the toolbar:
zh_cn: Steam 用户在工具栏上有三个额外按钮:

source: Version 1.4
zh_cn: 版本 1.4

source: <Optional> The horizontal scaling factor (use -1 to reset to default).
zh_cn: <可选> 水平缩放因数（使用-1重置为默认）

source: <Optional> The vertical scaling factor (use -1 to reset to default).
zh_cn: <可选> 垂直缩放因数（使用-1重置为默认）。

source: <Optional> The x offset position for drawing.
zh_cn: <Optional> 偏移x位置进行绘制

source: <Optional> The y offset position for drawing.
zh_cn: <Optional> 偏移y位置进行绘制

source: Backgrounds: still images used as background for the rooms
zh_cn: 背景: 作为房间的背景

source: Constants: a per-configuration list of the constants that you define for your game
zh_cn: 常量: 你的游戏中自定义的常量列表

source: Extensions: the extensions included with your game to expand functionality
zh_cn: 扩展: 游戏功能的扩展包

source: Fonts: to draw text in the game you can add fonts of many different styles
zh_cn: 字体: 绘制很多不同风格的字体

source: Included Files: files that your game will export to the chosen target for use
zh_cn: 包含文件: 生成目标游戏时需要包含的文件

source: NOTE: Previous versions of GameMaker accepted MIDI file format but that is not the case with GameMaker: Studio.
zh_cn: 注意: 老版本的 GameMaker 支持 MIDI 格式文件但是 GameMaker: Studio 并不支持。

source: NOTE: The Windows Phone SDK will also install Microsoft Visual Basic Express for Windows Phone as well, so there is no need to install it separately.
zh_cn: 注意: : Windows Phone SDK 还将安装 Microsoft Visual Basic Express for Windows Phone ，因此无需单独安装它。

source: NOTE: This function is for the Pro version of GameMaker: Studio only..
zh_cn: 注意: 这个函数只适用GameMaker: Studio 专业版。..

source: NOTE: This function is only available for use with the HTML5 module!
zh_cn: 注： 此函数仅适用于与HTML5模块一起使用！

source: NOTE: This functionality is limited to the Professional Version of GameMaker: Studio.
zh_cn: 注意: 此功能仅限于 Professional Version 的 GameMaker: Studio.

source: NOTE: You cannot mix the two types of argument variables when calling a script.
zh_cn: 注： 两种参数形式不能混用。

source: NOTE: You may be prompted by Windows Firewall (or any other firewall program that you run) to create a security exception for this module.
zh_cn: 注意：你也许会得到Windows防火墙（或者任何你正在运行的防火墙程序）的提示来让这个模块作为一个安全的例外程序来运行。

source: Note: To help you get familiar with GameMaker: Studio, it is strongly recommended that you follow some of the beginner tutorials that come bundled with the program.
zh_cn: 注意: 了熟悉 GameMaker: Studio，我们强烈建议您学习捆绑的初学者教程。

source: Objects: which are the building blocks on which your game is built
zh_cn: 物体: 这是你的游戏的基础结构

source: Paths: these can be used to make instances move along a pre-defined path
zh_cn: 路径: 可以使实例沿预定路径移动

source: Please note: GameMaker: Studio uses a C++ runner to create all final games and apps.
zh_cn: 请注意: GameMaker: Studio 使用 C++ 创建最终游戏。

source: Rooms: the space (levels) in which the objects are placed
zh_cn: 房间: 放置物体的空间 (关卡)

source: Scripts: a script is a piece of code to which you give a name and use like a GML function
zh_cn: 脚本: 脚本是一个代码块，你需要给它命名，然后像使用GML函数一样使用它们

source: Shaders: a shader is a combination of two "programs" written in a shader language to create graphical effects
zh_cn: 着色器: 着色器组合两个程序写在一个 着色器语言 来创建图形效果

source: Sounds: can be used in games as either background music or as sound effects
zh_cn: 声音: 可以用于游戏的背景音乐或音效

source: Sprites: images (often animated) that are used to represent the objects
zh_cn: 精灵: 图像 (通常是动画)，用于代表物体

source: Time lines: can be used to control the precise moment in a game that things should happen
zh_cn: 时间轴: 精确控制时间

source: GameMaker: Studio also has a number of vector-based functions, listed below:
zh_cn: GameMaker: Studio 还有一些基于向量的函数，被列举在下方：

source: GameMaker: Studio contains a built-in programming language, commonly called GML, which gives you much more flexibility and control over your games than the standard Drag and Drop actions do.
zh_cn: GameMaker: Studio 包含一个内置的编程语言，通常称为GML， 比拖放动作更灵活，更可控。

source: GameMaker: Studio does not have a built-in sound editor.
zh_cn: GameMaker: Studio 不内置声音编辑器。

source: GameMaker: Studio doesn't actually render most things to the screen directly, but instead it renders them to the application surface.
zh_cn: GameMaker: Studio 并不是将所有东西直接渲染到屏幕，而是相反地渲染到应用表面层。

source: GameMaker: Studio has its own proprietary programming language called the GameMaker Language (abbreviated to GML).
zh_cn: GameMaker: Studio 专有的编程语言称为GameMaker Language （简称 GML）。

source: GameMaker: Studio is an easy to use program for creating your own computer games.
zh_cn: GameMaker: Studio 是一个易于用来创建你自己的电脑游戏的程序。

source: GameMaker: Studio is not just limited to the resources that you create within the program as it has a special section on the resource tree of the main window for Included Files.
zh_cn: GameMaker: Studio 并不只能局限于使用那些你在IDE中创建的资源，事实上在主界面的资源列表中有一项专门的分类叫做 Included Files。

source: GameMaker: Studio offers an intuitive and easy to use Drag-and-Drop (referred to as 'DnD' from now on) interface of action icons that allow you to start on creating your own games very quickly.
zh_cn: GameMaker: Studio 提供了直观且易于拖放 (简称 'DnD' ) 的动作图标，使得您可以很快滴创建您自己的电脑游戏。

source: GameMaker: Studio requires a reasonably modern PC running Windows XP, Vista, 7, or later.
zh_cn: GameMaker: Studio 需要一个运行 Windows XP、Vista、7 或更高版本系统的电脑，

source: GameMaker: Studio requires an internet connection to activate your licence before you can use it.
zh_cn: GameMaker: Studio 在使用之前需要联网激活许可证。

source: GameMaker: Studio will create a *.dish file which you will then need to prepare in the Application Oven app on a Mac.
zh_cn: GameMaker: Studio 将创建 MAC 电脑上 Application Oven 所需的 *.dish 文件。

source: NOTE: Due to the modular nature of GameMaker: Studio there are certain things that are not included in the manual, particularly those aspects of setting up and connecting the different devices that can be supported.
zh_cn: 注：: 由于 GameMaker: Studio 的模块化性质，有些特定的内容并不包含在本手机中，特别是某些方面的设置以及支持设备的连接。

source: Clear Project Asset Compile Cache
zh_cn: 清除工程资源编译缓存

source: You must only use VS 2012 (the Express versions are fine), so even if you have a previous version of Visual Studio, it will not work with this module. A version of this product that supports Windows Store JavaScript app creation is essential as you will need it to create the *.pfx file which is your Developer Key and needed to submit your apps and games to the Windows Store.
zh_cn: 您必须只使用 VS 2012、2013 (或者 Express 版)，如果您使用旧版的VS，它不会与该模块一起工作。这个版本的VS支持创建 Windows 应用商店 JavaScript 软件所需要的 *.pfx 文件，并且需要 Developer Key(开发者秘钥) 一并提交到 Windows 应用商店。

source: Beneath the Download/Play button is the Subscribed button.
zh_cn: 下面的 Download/Play 按钮是 Subscribed (订阅) 按钮。

source: GameMaker: Studio stores images, sounds, scripts etc... between use in a cache so as to save time when testing your game as it will only re-compile those things that have been changed before testing.
zh_cn: GameMaker: Studio 储存 images、sounds、scripts 等... 使用缓存可以节约编译的时间使得只编译没有编译过得资源。

source: You may click this again to re-subscribe to the game, but bear in mind that this option is only available until you close the player.
zh_cn: 你可以再次点击重新订阅游戏，但是此选项仅在你关闭播放器之前才可以进行。

source: If you right-click on the data window, you can select how the data is displayed, setting the alignment and type, and you can also set how the data is laid out from the Columns box.
zh_cn: 如果你右击数据窗口，你就能查看数据是如何表现的，设定队列和类型，你也能设定数据是如何在列盒子中陈列的。

source: Note that you can also create your own custom bindings if those that are presented by default do not match what you require by selecting the Custom Keys option.
zh_cn: 需要注意的是，你还可以通过选择 Custom Keys (自定义热键) 选项为那些已经有默认快捷键的命令创建自己的 自定义热键。

source: Note! Not all IDE commands permit a keyboard shortcut.
zh_cn: 注意! 并非所有的集成开发环境命令都允许设置键盘快捷键。

source: GameMaker: Studio has a complete editor for creating these areas and in the editor you can add and change many aspects of how the room will look and play.
zh_cn: GameMaker: Studio 有一个完善的编辑器创建这些区域，在编辑器里你可以添加或更改许多视觉或游戏性方面的东西。

source: GameMaker: Studio can load many different formats of graphic files - with JPG, BMP, PNG and GIF being the most common bitmap formats, although you can also import SWF vector sprites and JSON skeletal animation sprites (made with Spine).
zh_cn: GameMaker: Studio 可以加载多种格式的图片如 JPG、BMP、PNG 和 GIF。当然你还可以导入 SWF 矢量 sprites 和 JSON 格式的骨骼动画 sprites (用 Spine 创建的)。

source: The above image has two views with two view ports, each one drawn at different positions.
zh_cn: 上面的图片输出了两个视野，每一个绘制在不同的位置。

source: NOTE: If you have resized the game window (for example, by switching from full screen to windowed), and wish to center the new window, this function should be called in an alarm[0] at least one step later than the window size change, otherwise it will not work correctly.
zh_cn: 注： 如果你已经在重置游戏窗口大小（例如切换全屏到窗口），并且希望新的窗口屏幕居中，你应该使用一个alarm[0]（计时器） 来调用这个函数，至少在窗口更改 one step（一步）之后，否则可能会出现问题。

source: NOTE: This function is only available on the Windows, Mac OSX and Linux platforms.
zh_cn: 注意: 这个函数只适用于 Windows、 Mac OSX 和Linux 平台。

source: NOTE: This function is only valid for the Windows and Mac OSX only (on Mac OSX it contains a pointer to an NSWindow class).
zh_cn: 注： 这个函数 只对 Windows 和 Mac OSX 有效 (在 Mac OSX 上，它包含一个 NSWindow 类的指针）。

source: NOTE: This function is slow and so should only be used when absolutely necessary.
zh_cn: 注： 这个函数效率极低，绝对必要时才用它。

source: WARNING!:The current Tizen SDK does not work on Windows 8, so you will need to have an earlier OS installed on your development machine (you can dual boot to Windows XP, Vista, or 7).
zh_cn: 。警告!:! 当前的 Tizen SDK 不能在 Windows 8 上工作，所以你需要在你的电脑上安装早期的系统 (你可以安装 Windows XP、Vista 或 win7)。

source: But that's changed with the advent of GameMaker: Studio.
zh_cn: 但是 GameMaker: Studio 的到来改变了这一事实。.

source: This second button will open up the page of the GameMaker: Studio Steam Workshop in the Steam client window on your PC.
zh_cn: 第二个按钮将打开 Steam 客户端的 GameMaker: Studio Steam Workshop 页面。

source: NOTE: These functions are for Windows, Ubuntu (Linux), MacOS and HTML5 target modules only and may not work on any other device.
zh_cn: 注：这些函数只适合Windows、 Ubuntu (Linux)、 MacOS 以及 HTML5 目标模块，其它设备无法使用它们。

source: NOTE: This functions is for Windows and Mac OSX only (on Mac OSX it contains a pointer to an NSWindow class).
zh_cn: 注意: 这个函数只用于 Windows 和 Mac OSX (Mac OSX 包含了一个指向 NSWindow 类的指针)。

source: NOTE: This variable will not work on the HTML5 target module, nor the Windows 8 (JavaScript) module.
zh_cn: 注意: 这个变量将不适用于HTML5模块和 Windows 8 (JavaScript) 模块。

source: GameMaker: Studio permits you 8 independent views (numbered from 0 - 7), all of which can be active at any one time, and all of which can show different parts of the same room.
zh_cn: GameMaker: Studio 允许8个独立的视野（编号0-7），所有的视野都可以在任何时候激活，而且都可以展示相同房间的不同地方。

source: GameMaker: Studio requires DirectX version 9.0 or later to be installed on your computer.
zh_cn: GameMaker: Studio 设计和测试游戏时需要在计算机上安装 DirectX 9或更高版本

source: GameMaker: Studio supports this with a few simple functions that work in conjunction with the Asynchronous Cloud Event.
zh_cn: GameMaker: Studio 提供这几个简单的函数来实现 异步云事件(Asynchronous Cloud Event)。

source: NOTE: On devices the debug module will connect over WiFi automatically, however should you have any configuration issues, you will need to go to the Preferences and switch on "Manual IP Entry".
zh_cn: 注意： 在仪器上时调试模块会自动连接WiFi，如果你有任何配置问题，你还是需要在首选项中打开“手动输入IP”。

source: NOTE: This function does not work on the HTML5 target.
zh_cn: 注： 这个函数不支持HTML5平台。

source: NOTE: if you have not previously set a render target with the function surface_set_target, using this function will silently (ie: without any error messages) end all further code execution for the event.
zh_cn: 注： 如果没有使用 surface_set_target提前设置渲染的目标，用这个函数将悄悄的（比如：没有错误信息）结束运行这个事件后面的代码。

source: NOTE: The higher the quality, the larger the file, and this should be taken into account when deciding what bitrate to choose.
zh_cn: 注意: 质量越高文件越大，请自行取舍。

source: NOTE: This function is only valid for the HTML5, Windows 8 (JS), and Tizen (JS) modules.
zh_cn: 注意： 这个函数只适用于 HTML5、Windows 8 (JS) 和 Tizen (JS) 模块。

source: Stop Web Server
zh_cn: 停止 web 服务器

source: Create Executable For Target
zh_cn: 生成目标程序

source: NOTE: Although most modern PCs ship with DirectX 10 and higher, this does not mean that DirectX 9 is present on your machine, and you should still install it from the link given above!
zh_cn: 注意: 尽管现代的电脑安装了 DirectX 10 或者更高版本但这并不意味自在您的机器上也安装了 DirectX 9，所以您仍然需要下载它。

source: NOTE: You can set the distance that an instance or object can move before the view starts following using the view_hborder and view_vborder functions.
zh_cn: 注意: 你可以使用 view_hborder 和 view_vborder 函数设置视野开始移动之前实例移动的距离。

source: NOTE: if you are not setting the x and y position of the view manually, the view never leaves the boundaries of the room.
zh_cn: 注意: 如果没有手动设置视野的x、y位置，视野将不会离开房间的边界。

source: The final button available to you will open another version of the GameMaker: Studio IDE so you can have two (or more) projects open at one time.
zh_cn: 最后的按钮可以让你打开 GameMaker: Studio IDE 的另一个版本，所以你可以同时开发两个 (或多个) 工程。

source: These might not work correctly in this new version due to changes in GameMaker over the years, and as such it is recommended that you check out the YoYo Knowledge Base to see what's changed between versions before deciding to import legacy files.
zh_cn: 在新版本中有可能无法正常工作，建议查阅 YoYo 知识库 比较两者的区别。

source: GameMaker: Studio will then parse the file and create character ranges for the text found within.
zh_cn: 接下来 GameMaker: Studio 会解析这个文件然后根据在文件中找到的字符创建相应的字符范围。

source: <statement>;
zh_cn: <语句>;

source: <variable> = <expression>;
zh_cn: <变量> = <表达式>;

source: A "do" is really the "do... until" statement as you cannot have one without the other.
zh_cn: “do”也就是“do... until”，缺一不可。

source: A "for" statement has this form:
zh_cn: “For”语句的结构：

source: A "repeat" statement has the form
zh_cn: “repeat”语句的结构：

source: A "while" statement has the form
zh_cn: 一个“while”语句具有这种形式：

source: A 2D array needs to be initialised before use, the same as a 1D array, and can hold real numbers, strings and constants, just like any other variable, making them ideal candidates for any game that needs to store large amounts of data in an easily accessible way (remember, you can loop through an array easily).
zh_cn: 二维数组在使用前同样也需要初始化，和其它的变量一样，也可以存储实数、字符串和常量。在需要便捷地储存大量数据时，二维数组是一个理想的选择（记住，数组中循环非常方便）。

source: A 32-bit system is not supported.
zh_cn: 32 位 系统不支持。

source: A CPU that supports Intel VTx
zh_cn: 支持 Intel VTx 的 CPU

source: A DirectX 9 (or later) compatible graphics card with at least 32MB of memory is required for most created games.
zh_cn: 一个兼容 DirectX 9 (或更高版本) 、显存 至少 32MB的显卡。

source: A breakpoint is a place in your game code that you wish it to stop at so you can see what's going on.
zh_cn: 断点是你游戏代码中你需要暂停的地方，这样你就能观察到底发生了什么。

source: A brief description of the data being stored.
zh_cn: 所存储数据的简要说明。

source: A code block consists of a set of instructions, called statements, that are then interpreted by GameMaker: Studio and used to make something happen within your game.
zh_cn: 一个代码段包含一系列指令，也可称作“语句”。这些指令在游戏运行时，由 GameMaker: Studio 解释并执行，以实现某种功能。

source: A conflict was encountered, but the gamer chose to ignore it
zh_cn: 遇到冲突,但玩家选择忽略它。

source: A considerable number of useful sprites are bundled with GameMaker: Studio to help you get started and other collections of useful sprites can be found on the YoYo Games website which can all be used as "place holders" until you have enough confidence to make your own or get together with an artist, but please note that the bundled sprites are not for distribution in any finished works that you make.
zh_cn: 很多有用的 sprites 包含在 GameMaker: Studio 帮助你开始制作游戏，也可以在 YoYo Games 网站找到，作为 "占位符" 使用，直到你有足够的信心制作精美的 sprites 去替代它们。但是这些 "占位符" 不能够用于 成品。

source: A file selector dialogue pops up in which you can select the sound file, which can only be either a wave file or an MP3 file.
zh_cn: 文件选择对话框将会弹出，你可以选择声音文件。只能 选择 wave 或者 MP3文件。

source: A font typically consist of 256 characters, numbered from 0 to 255, but in general you use only a small portion of these.
zh_cn: 一个字体通常包含了256个字符，编号从0到255，不过通常情况下你只会用到其中的一小部分。

source: A form will then open in which you can change the properties of that resource (more on this in the following sections of the manual)
zh_cn: 将会打开新资源的属性 (更多信息在接下来的部分查看)。

source: A global variable that is used to get access to the application surface index.
zh_cn: 用于访问应用表面层索引的全局变量。

source: A local push notification is local to the device that the game is installed on, and requires no backend server.
zh_cn: 本地通知由安装游戏的设备直接推送，并不需要后端服务器。

source: A percentage of 100 means nothing changes.
zh_cn: 100%意味着没有任何变化。

source: A persistent object is one that does not go away when the room is changed, but rather it "persists" and is carried over into the new room.
zh_cn: 一个持续性的物体不会随着房间的改变而被摧毁，

source: A script (like any built-in function) can take different input variables, with real, string, boolean and special values like all or noone being accepted, and these input variables are generally called arguments, although they are also referred to as parameters.
zh_cn: 一个脚本（和一个内建函数相似）可以接受不同类型的输入变量，具体来说它支持实数、字符串、布尔型以及一些特殊的变量类型（比如 all 和 no-one）。这些输入变量我们通常称作自变量或者参数。A script (like any built-in function) can take different input variables, with real, string, boolean and special values like all or noone being accepted, and these input variables are generally called arguments, although they are also referred to as parameters.

source: A script is a (usually) short snippet of code in GML that you write to create your own functions.
zh_cn: 一段代码，也是常说的函数。

source: A simple "if" statement takes this form:
zh_cn: 一个简单的"if"语句具有这种形式：

source: A special file dialog window opens in which you can choose the sprite you want to import into GameMaker: Studio:
zh_cn: 会打开一个特殊的对话框，选择你想导入到 GameMaker: Studio:

source: A sprite is often not a single image but a set of images that are shown one after the other to create an animation and in this way it can look like a character is walking, or a ball is rotating, or an enemy is exploding, etc...
zh_cn: 一个精灵往往不是一个单一的形象，而是一整套一个接一个显示的动画，这样它们看起来就像行走的角色、旋转的球或敌人爆炸等。

source: A streamed sound will be one that is uncompressed and played in real time, streamed from the disc.
zh_cn: 流式传输的声音未压缩，从磁盘按流实时播放。

source: A switch statement has the following form:
zh_cn: switch语句结构如下：

source: A value of 0 (or a positive value) indicates a success(see below for exact values), and the “resultString” will contain the returned data or a success message.
zh_cn: 0 （或者大于0的值） 代表成功(见下文)的返回, “resultString” 中包含返回的消息数据。

source: Accessors
zh_cn: 访问器

source: Actions
zh_cn: 动作

source: Activating GameMaker: Studio
zh_cn: 激活 GameMaker: Studio

source: Activation
zh_cn: 激活

source: Actually, that's not quite true!
zh_cn: 事实上，那并不准确！

source: Additional Modules
zh_cn: 附加模块

source: Additionally, you can load up GameMaker backup files (*.gb1, *.gb2 etc) from this tab too.
zh_cn: 此外，你也可以载入 GameMaker 备份文件 (*.gb1, *.gb2 等)。

source: Addressing Variables in Other Instances
zh_cn: 访问其它实例的变量

source: Adds a value to a cell in a grid.
zh_cn: 向栅格中的一个单元格叠加一个值

source: Adds the contents of the cells in a source grid to the cells in a destination grid.
zh_cn: 将源栅格的单元格内容叠加给一个靶栅格内的单元格。

source: Adds the given value to all cells in a region.
zh_cn: 将一个被给定的值叠加给一片区域内所有单元格。

source: Adds to all the cells in a circular region in a grid to an indicated value (can both be a number or a string).
zh_cn: 向一个栅格内的一个圆形区域内的所有单元格叠加一个指定的值

source: Advanced Array Functionality
zh_cn: 数组高级功能

source: Advanced Functions
zh_cn: 高级函数

source: Advanced Use - Configurations
zh_cn: 高级使用 - 配置

source: Advertising and Analytics
zh_cn: 广告与分析

source: After all this information, you will then find a list of all local variables that are currently declared for the code block being stepped through.
zh_cn: 在所有信息之后，你会发现一个包括了所有局部变量的列表，这些都是在按步跳过的代码块中当前声明的局部变量

source: After that you can add a description of your game, which can be as long or short as you wish, and finally, at the bottom, you can add search tags too.
zh_cn: 之后，可以为你的游戏添加一个描述。

source: After this has been done, clicking "Proceed" will take you to the purchase page to confirm the sale.
zh_cn: 完后之成，点击 "Preceed (继续)" 将带你到支付页面以确认这次购买。

source: All Instances
zh_cn: All Instances（所有实例）

source: All cells within the grid will then contain this value, which can be a real number or a string.
zh_cn: 所有在这个栅格中的单元格接下来都会包含这个值，可以是一个实数或者一个字符串。

source: All moments in between will be deleted.
zh_cn: 在这个范围之中的全部时刻都会被删除。

source: All operators work for real values, but comparisons also work for strings and + concatenates strings.
zh_cn: 所有运算符都是为实数工作的，但是比较运算符也可以比较字符串，并且 + 号可以连接字符串。

source: All sprites (and all other resources) must have a name given to them so that you (and GameMaker: Studio!) can identify them easily, although you should note that the actual name itself is really just a variable which holds a number that "points" to the resource, in this case a sprite.
zh_cn: 所有的精灵 (或其他资源) 必须有一个名称使得你 (和 GameMaker: Studio!) 可以很轻松地识别它们,但值得注意的是名称本身只是一个变量，

source: All the object names, constants, IDs etc... simply represent values and these can be dealt with like any other value.
zh_cn: 所有的物体名称、常量、ID等等……可以当作任何其它值一样处理。

source: All these commands can also be accessed through the drop-down menus or by using certain "hot key" combinations.
zh_cn: 所有这些命令都可以通过下拉菜单或 "热键" 来执行。

source: All together they are called resources and assets, and in the main screen of GameMaker: Studio you can find them on the left-hand side in a space called the resource tree.
zh_cn: 它们被称作 resources (资源) 和 assets (资产)，并且在 GameMaker: Studio 的主屏幕你可以在左手边称为 resource tree (资源树) 的地方找到它们。

source: All versions can compile to Windows (as well as the Steam Workshop if you have downloaded your version through the Steam client).
zh_cn: 所有版本均可编译 Windows 游戏 (如果通过 Steam 客户端下载本软件，还可以发布到 Steam Workshop (创意工坊) )。

source: Also a DirectX 9 compatible sound card, or integrated sound chip, is required.
zh_cn: 一个兼容 DirectX 9 的声卡或者集成语音芯片。

source: Also note that if you deactivate a persistent object, it will no longer pass from one room to another unless re-activated before the Room End event is triggered.
zh_cn: 还需要注意的是如果你 deactivate (停用) 一个持续性物体，它将不会从一个房间到另一个房间，直到被重新激活。
